{
  "title": "Winston Zirjacks III - Web Developer",
  "page-header": "Oh hey,<br/> it's Winston",
  "page-subheader": "web developer and general enthusiast.",
  "what-im-about": [
    "I'm a front-end web developer with a penchant for developing clean and usable interfaces. I enjoy and take pride in working with scalable and mantainable stylesheets, building semantic and cross-browser compatable HTML, and peppering content with UX that helps tells stories instead of holding hands.",
    "My experience is varied. The first leg of my experience in this industry is from a start-up where we designed and built a web-based point-of-sale system. The second was spent at an agency where we built web-apps for tech-industry events. The third leg is currently being filled at an agency where we aid local businesses by designing and implementing sites for popular e-commerce systems.",
    "We all know that it takes four legs to make a large and stable table. Three legs is enough for a small corner table, but my ambitions require the use all of these legs - and then some - to help support and raise a team towards whatever goals they may wish to achieve.",
    "I know that sounds incredibly hyperbolic and a tad bit contrived, but lets be honest here: I just want to use my skills to help people do stuff better. Let us build that fourth leg together so that we can all stand higher and finally replace that proverbial lightbulb left dim above our heads."
  ],
  "professional-interests": ["Javascript", "HTML5/CSS3", "React.js", "Scalable CSS", "Build Tools", "ES6/ES7", "Functional Programming", "Solving Problems", "Identifying Patterns and Solutions", "Professional Improvement"],
  "personal-interests": [ "Rock Climbing", "Bicycle Touring", "BMX", "Mountain Biking", "Cats (mine, specifically)", "Loud Music", "Camping", "Peronsal Improvement"],
  "quotes": {
    "boss": [
      "Reed is a skilled, knowledgeable team player. Overall he has a positive attitude and has aptly tackled everything we've thrown at him over the years, both frontend and backend. I would definitely recommend him.",
      "Jon Cattivera -  CEO @ Sleepless Media"
    ]
  },
  "simple-note": [
    "I designed and built this website with simplicity in mind. It's readable, clean, and anyone can navigate it's content intuitively. Any modern browser will be able to load this page predictably and consistently. It's already responsive and the page-weight is incredibly low.",
    "This design took inspiration from <a href='http://motherfuckingwebsite.com/' target='_blank'>http://motherfuckingwebsite.com/</a> website, while adding in some low-cost reset and animation css. It's still lightweight, but you can always check the link at the top of the page to see a more standard portfolio design."
  ],
  "connect": [
    "phone: (916) 628-0087",
    "email: <a href='mailto:winston.zirjacks.iii@gmail.com'>winston.zirjacks.iii@gmail.com</a>"
  ],
  "social-media": {
    "LinkedIn": "https://www.linkedin.com/in/winston-zirjacks-2071a918/",
    "Github": "https://github.com/winstonzirjacksiii"
  },
  "sleepless-projects": [
    {
      "name": "Harris Ranch",
      "url": "http://www.harrisranch.com/home/",
      "tech": "Shopify, Wordpress, CSS3, SASS, jQuery, Liquid",
      "pic": "harris-ranch-laptop-phone.jpg",
      "desc": "On this project I was tasked with building out a responsive design consistent across both a single Wordpress installation and a sister Shopify store. The themes themselves are both modular and easily editable/mantainable by the client. While not technically impressive, this project represents my ability to work on a team and iterate over ideas, design fallbacks, and to ultimately build to a design approved by a large group of people."
    },
    {
      "name": "PNP Suppliments",
      "url": "https://pnpsupplements.com/",
      "tech": "Shopify, CSS3, Javascript+jQuery, Git, NPM, shopify-themekit, SMACCS, Liquid",
      "pic": "pnp-laptop-phone.jpg",
      "desc": "This is one of the first shopify projects in our agency where I was able to develop using the shopify themekit toolkit. Themekit allows for local development, so we were finally able to use NPM build tools and git for organizing code and versioning. We also needed to overcome limits imposed on the shopify system (multiple sections of information attached to products instead of just the single \"description\" text) while allowing the client to easily mantain the content with full WYSIWYG editing ability. Due to budget constraints, we opted to avoid app development and instead repurposed menu and page objects through a nameing naming system to allow section modularity within a system where it isn't explicitly supported."
    }
  ],
  "personal-projects": [
    {
      "name": "Open Weather Maps React Demo",
      "url": "https://github.com/winstonzirjacksiii/owm-react-demo",
      "tech": "React, ES6, NPM, Javascript, LocalStorage, CSS3, HTML5, SASS, SMACCS",
      "desc": "This is my first semi-involved React app. It uses the Open Weather Maps API to search for and display current weather. Data updates automatically and saves to LocalStorage so that it can be accessable in-browser on later page loads. Style-wise, this one is relatively half-baked."
    },
    {
      "name": "30 Minute Vanilla JS AJAX Challenge",
      "url": "https://github.com/winstonzirjacksiii/30min-vanilla-ajax-challange",
      "tech": "Vanilla Javascript, CSS, Semantic Elements, AJAX",
      "desc": "I built this project as a simple expiriment knowing of some of the basic javascript technical screener questions. I set a timer and built out what I could manage in 30 minutes from scratch. This uses the Github REST API to search for and return a list of public repositories for any given user. That's it. I got excited when I was first building the project and yes, challenge is misspelt in the URL."
    }
  ]
}
